app/controllers/logos_controller.rb

  def create
    @logo = Logo.new(logo_params)
    @logo.converter_id = svg(@logo)
    if @logo.save
---
INSERT INTO "logos" ("title", "description", "created_at", "updated_at", "converter_id", "file_id", "svg_code") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def show
    @logo = Logo.find(params[:id])
---
SELECT "logos".* FROM "logos" WHERE "logos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]